Project/Toir.Adaptation/src/Documents/торо_ИзменениеПоложенияВСтруктуреИерархии/торо_ИзменениеПоложенияВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИзменениеПоложенияВСтруктуреИерархии</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ПоложенияВСтруктуреИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="774db338-91f2-4ead-8895-fd51f145458a">
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="d8481881-51b9-4962-8b6c-bfa78e30e457">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2c99b177-de41-496b-bfc8-0cd1b039671a">
    <name>Удален</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="280e0fd3-b182-49f3-abd2-2c4247cfe274">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6bc5297f-c3fd-4ba2-ad6f-c69875395c47">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_ИзменениеПоложенияВСтруктуреИерархии/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Если ДополнительныеСвойства.Свойство("ТолькоОР") И ДополнительныеСвойства.ТолькоОР.Количество() Тогда 
		Для Каждого ОбъектРемонтаИзМассива Из ДополнительныеСвойства.ТолькоОР Цикл
			гкс_ПроверкаФункциональныхМест.ОбновитьТекущийОР(ОбъектРемонтаИзМассива);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если СтруктураИерархии = Константы.торо_ИерархияДляВводаНовыхОР.Получить() Тогда 
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			ТолькоОР = Новый Массив();
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	торо_РасположениеОРВСтруктуреИерархии.ОбъектИерархии КАК ОР
				|ИЗ
				|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии КАК торо_РасположениеОРВСтруктуреИерархии
				|ГДЕ
				|	торо_РасположениеОРВСтруктуреИерархии.Регистратор = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТолькоОР.Добавить(Выборка.ОР);
			КонецЦикла;

			ДополнительныеСвойства.Вставить("ТолькоОР",ТолькоОР);
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			ТолькоОР = Новый Массив();
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	торо_РасположениеОРВСтруктуреИерархии.ОбъектИерархии КАК ОР
				|ИЗ
				|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии КАК торо_РасположениеОРВСтруктуреИерархии
				|ГДЕ
				|	торо_РасположениеОРВСтруктуреИерархии.Регистратор = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТолькоОР.Добавить(Выборка.ОР);
			КонецЦикла;

			ДополнительныеСвойства.Вставить("ТолькоСтарыеОР",ТолькоОР);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не Отказ Тогда 
		Если ДополнительныеСвойства.Свойство("ТолькоСтарыеОР") И ДополнительныеСвойства.ТолькоСтарыеОР.Количество() > 0 Тогда 
			Движения.торо_РасположениеОРВСтруктуреИерархии.ДополнительныеСвойства.Вставить("ТолькоОР",ДополнительныеСвойства.ТолькоСтарыеОР);
		КонецЕсли;
		// проверка
		ТолькоОР = Новый Массив();
		Для Каждого СтрокаТаблицы Из ПоложенияВСтруктуреИерархии Цикл
			Если Не СтрокаТаблицы.Удален Тогда 
				Если ТолькоОР.Найти(СтрокаТаблицы.ОбъектИерархии) = Неопределено Тогда 
					ТолькоОР.Добавить(СтрокаТаблицы.ОбъектИерархии);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаМассива Из ТолькоОР Цикл
			НаборЗаписей = РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(СтрокаМассива.Ссылка);
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.Объект = СтрокаМассива.Ссылка;
			НоваяСтрока.Период = ТекущаяДата();
			НаборЗаписей.Записать();
		КонецЦикла;
		//История
		Если Константы.торо_ДатаНачалаФиксацииПеремещенийМеждуФМ.Получить() <= ТекущаяДата() Тогда 
			
			ТабЧасть = Новый ТаблицаЗначений();
			ТабЧасть.Колонки.Добавить("ОбъектИерархии",Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
			ТабЧасть.Колонки.Добавить("РодительИерархии",Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
			ТабЧасть.Колонки.Добавить("СтруктураИерархии",Новый ОписаниеТипов("СправочникСсылка.торо_СтруктурыОР"));
			ТабЧасть.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
			
			Для Каждого ТекСтрокаПоложенияВСтруктуреИерархии Из ПоложенияВСтруктуреИерархии Цикл
				Если Не ТекСтрокаПоложенияВСтруктуреИерархии.Удален Тогда 
					НоваяСтрока = ТабЧасть.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрокаПоложенияВСтруктуреИерархии);
					НоваяСтрока.СтруктураИерархии = СтруктураИерархии;
					НоваяСтрока.Период = Дата;
				КонецЕсли;
			КонецЦикла;
			Запрос = Новый запрос();
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТЧ.ОбъектИерархии КАК ОбъектИерархии,
			               |	ВЫРАЗИТЬ(ТЧ.РодительИерархии КАК Справочник.торо_ОбъектыРемонта) КАК РодительИерархии,
			               |	ТЧ.СтруктураИерархии КАК СтруктураИерархии,
			               |	ТЧ.Период КАК Период
			               |ПОМЕСТИТЬ Исходная
			               |ИЗ
			               |	&ТЧ КАК ТЧ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	Исходная.ОбъектИерархии КАК ОбъектИерархии,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
			               |	Исходная.СтруктураИерархии КАК СтруктураИерархии
			               |ПОМЕСТИТЬ РодителиОР1
			               |ИЗ
			               |	Исходная КАК Исходная
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			               |				&Дата,
			               |				СтруктураИерархии = &СтруктураИерархии
			               |					И НЕ Регистратор = &Ссылка) КАК торо_ИерархическиеСтруктурыОР
			               |		ПО Исходная.РодительИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
			               |			И (НЕ Исходная.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	РодителиОР1.ОбъектИерархии КАК ОбъектИерархии,
			               |	РодителиОР1.СтруктураИерархии КАК СтруктураИерархии,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии
			               |ПОМЕСТИТЬ РодителиОР2
			               |ИЗ
			               |	РодителиОР1 КАК РодителиОР1
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			               |				&Дата,
			               |				СтруктураИерархии = &СтруктураИерархии
			               |					И НЕ Регистратор = &Ссылка) КАК торо_ИерархическиеСтруктурыОР
			               |		ПО РодителиОР1.РодительИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
			               |			И (НЕ РодителиОР1.ЭтоФМ)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	Исходная.ОбъектИерархии КАК ОбъектИерархии,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
			               |	Исходная.СтруктураИерархии КАК СтруктураИерархии
			               |ПОМЕСТИТЬ ПредРодителиОР1
			               |ИЗ
			               |	Исходная КАК Исходная
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			               |				&Дата,
			               |				СтруктураИерархии = &СтруктураИерархии
			               |					И НЕ Регистратор = &Ссылка) КАК торо_ИерархическиеСтруктурыОР
			               |		ПО Исходная.ОбъектИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	РодителиОР1.ОбъектИерархии КАК ОбъектИерархии,
			               |	РодителиОР1.СтруктураИерархии КАК СтруктураИерархии,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии
			               |ПОМЕСТИТЬ ПредРодителиОР2
			               |ИЗ
			               |	ПредРодителиОР1 КАК РодителиОР1
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			               |				&Дата,
			               |				СтруктураИерархии = &СтруктураИерархии
			               |					И НЕ Регистратор = &Ссылка) КАК торо_ИерархическиеСтруктурыОР
			               |		ПО РодителиОР1.РодительИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
			               |			И (НЕ РодителиОР1.ЭтоФМ)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	РодителиОР1.ОбъектИерархии КАК ОбъектИерархии,
			               |	РодителиОР1.СтруктураИерархии КАК СтруктураИерархии,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
			               |	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии
			               |ПОМЕСТИТЬ ПредРодителиОР3
			               |ИЗ
			               |	ПредРодителиОР2 КАК РодителиОР1
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			               |				&Дата,
			               |				СтруктураИерархии = &СтруктураИерархии
			               |					И НЕ Регистратор = &Ссылка) КАК торо_ИерархическиеСтруктурыОР
			               |		ПО РодителиОР1.РодительИерархии = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
			               |			И (НЕ РодителиОР1.ЭтоФМ)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ПредРодителиОР1.ОбъектИерархии КАК ОбъектИерархии,
			               |	ПредРодителиОР1.РодительИерархии КАК РодительИерархии,
			               |	ПредРодителиОР1.СтруктураИерархии КАК СтруктураИерархии
			               |ПОМЕСТИТЬ ВсеПрошлые
			               |ИЗ
			               |	ПредРодителиОР1 КАК ПредРодителиОР1
			               |ГДЕ
			               |	ПредРодителиОР1.ЭтоФМ = ИСТИНА
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ПредРодителиОР1.ОбъектИерархии,
			               |	ПредРодителиОР1.РодительИерархии,
			               |	ПредРодителиОР1.СтруктураИерархии
			               |ИЗ
			               |	ПредРодителиОР2 КАК ПредРодителиОР1
			               |ГДЕ
			               |	ПредРодителиОР1.ЭтоФМ = ИСТИНА
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ПредРодителиОР1.ОбъектИерархии,
			               |	ПредРодителиОР1.РодительИерархии,
			               |	ПредРодителиОР1.СтруктураИерархии
			               |ИЗ
			               |	ПредРодителиОР3 КАК ПредРодителиОР1
			               |ГДЕ
			               |	ПредРодителиОР1.ЭтоФМ = ИСТИНА
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ИзРег.ОбъектИерархии КАК ОбъектИерархии,
			               |	ИзРег.РодительИерархии КАК РодительИерархии
			               |ПОМЕСТИТЬ Предыдущие
			               |ИЗ
			               |	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			               |			&Дата,
			               |			СтруктураИерархии = &СтруктураИерархии
			               |				И НЕ Регистратор = &Ссылка
			               |				И ОбъектИерархии В
			               |					(ВЫБРАТЬ
			               |						ТЧ.ОбъектИерархии
			               |					ИЗ
			               |						Исходная КАК ТЧ)) КАК ИзРег
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	Исходная.ОбъектИерархии КАК ОбъектИерархии,
			               |	Исходная.РодительИерархии КАК РодительИерархии,
			               |	Исходная.СтруктураИерархии КАК СтруктураИерархии,
			               |	Исходная.Период КАК Период,
			               |	ЕСТЬNULL(ВсеПрошлые.РодительИерархии, Предыдущий.РодительИерархии) КАК ПредыдущийРодитель
			               |ПОМЕСТИТЬ БезПодчиненных
			               |ИЗ
			               |	Исходная КАК Исходная
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Предыдущие КАК Предыдущий
			               |		ПО Исходная.ОбъектИерархии = Предыдущий.ОбъектИерархии
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПрошлые КАК ВсеПрошлые
			               |		ПО Исходная.ОбъектИерархии = ВсеПрошлые.ОбъектИерархии
			               |			И Исходная.СтруктураИерархии = ВсеПрошлые.СтруктураИерархии
			               |ГДЕ
			               |	(НЕ ВсеПрошлые.РодительИерархии ЕСТЬ NULL
			               |			ИЛИ Исходная.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
			               |			ИЛИ НЕ Предыдущий.РодительИерархии ЕСТЬ NULL
			               |				И Предыдущий.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	Исходная.ОбъектИерархии,
			               |	РодителиОР1.РодительИерархии,
			               |	Исходная.СтруктураИерархии,
			               |	Исходная.Период,
			               |	ЕСТЬNULL(ВсеПрошлые.РодительИерархии, Предыдущий.РодительИерархии)
			               |ИЗ
			               |	Исходная КАК Исходная
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Предыдущие КАК Предыдущий
			               |		ПО Исходная.ОбъектИерархии = Предыдущий.ОбъектИерархии
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РодителиОР1 КАК РодителиОР1
			               |		ПО Исходная.ОбъектИерархии = РодителиОР1.ОбъектИерархии
			               |			И Исходная.СтруктураИерархии = РодителиОР1.СтруктураИерархии
			               |			И (РодителиОР1.ЭтоФМ)
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПрошлые КАК ВсеПрошлые
			               |		ПО Исходная.ОбъектИерархии = ВсеПрошлые.ОбъектИерархии
			               |			И Исходная.СтруктураИерархии = ВсеПрошлые.СтруктураИерархии
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	Исходная.ОбъектИерархии,
			               |	РодителиОР2.РодительИерархии,
			               |	Исходная.СтруктураИерархии,
			               |	Исходная.Период,
			               |	ЕСТЬNULL(ВсеПрошлые.РодительИерархии, Предыдущий.РодительИерархии)
			               |ИЗ
			               |	Исходная КАК Исходная
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Предыдущие КАК Предыдущий
			               |		ПО Исходная.ОбъектИерархии = Предыдущий.ОбъектИерархии
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РодителиОР2 КАК РодителиОР2
			               |		ПО Исходная.ОбъектИерархии = РодителиОР2.ОбъектИерархии
			               |			И Исходная.СтруктураИерархии = РодителиОР2.СтруктураИерархии
			               |			И (РодителиОР2.ЭтоФМ)
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПрошлые КАК ВсеПрошлые
			               |		ПО Исходная.ОбъектИерархии = ВсеПрошлые.ОбъектИерархии
			               |			И Исходная.СтруктураИерархии = ВсеПрошлые.СтруктураИерархии
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	БезПодчиненных.РодительИерархии КАК РодительИерархии,
			               |	БезПодчиненных.СтруктураИерархии КАК СтруктураИерархии,
			               |	БезПодчиненных.Период КАК Период,
			               |	БезПодчиненных.ПредыдущийРодитель КАК ПредыдущийРодитель,
			               |	Подчиненные.ОбъектИерархии КАК ОбъектИерархии
			               |ПОМЕСТИТЬ Уровень1
			               |ИЗ
			               |	БезПодчиненных КАК БезПодчиненных
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			               |				&Дата,
			               |				СтруктураИерархии = &СтруктураИерархии
			               |					И НЕ Регистратор = &Ссылка) КАК Подчиненные
			               |		ПО БезПодчиненных.ОбъектИерархии = Подчиненные.РодительИерархии
			               |			И (НЕ Подчиненные.ОбъектИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	БезПодчиненных.РодительИерархии КАК РодительИерархии,
			               |	БезПодчиненных.СтруктураИерархии КАК СтруктураИерархии,
			               |	БезПодчиненных.Период КАК Период,
			               |	БезПодчиненных.ПредыдущийРодитель КАК ПредыдущийРодитель,
			               |	Подчиненные.ОбъектИерархии КАК ОбъектИерархии
			               |ПОМЕСТИТЬ Уровень2
			               |ИЗ
			               |	Уровень1 КАК БезПодчиненных
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			               |				&Дата,
			               |				СтруктураИерархии = &СтруктураИерархии
			               |					И НЕ Регистратор = &Ссылка) КАК Подчиненные
			               |		ПО БезПодчиненных.ОбъектИерархии = Подчиненные.РодительИерархии
			               |			И (НЕ Подчиненные.ОбъектИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	БезПодчиненных.РодительИерархии КАК РодительИерархии,
			               |	БезПодчиненных.СтруктураИерархии КАК СтруктураИерархии,
			               |	БезПодчиненных.Период КАК Период,
			               |	БезПодчиненных.ПредыдущийРодитель КАК ПредыдущийРодитель,
			               |	Подчиненные.ОбъектИерархии КАК ОбъектИерархии
			               |ПОМЕСТИТЬ ВсеУровни
			               |ИЗ
			               |	Уровень2 КАК БезПодчиненных
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			               |				&Дата,
			               |				СтруктураИерархии = &СтруктураИерархии
			               |					И НЕ Регистратор = &Ссылка) КАК Подчиненные
			               |		ПО БезПодчиненных.ОбъектИерархии = Подчиненные.РодительИерархии
			               |			И (НЕ Подчиненные.ОбъектИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	БезПодчиненных.РодительИерархии,
			               |	БезПодчиненных.СтруктураИерархии,
			               |	БезПодчиненных.Период,
			               |	БезПодчиненных.ПредыдущийРодитель,
			               |	БезПодчиненных.ОбъектИерархии
			               |ИЗ
			               |	БезПодчиненных КАК БезПодчиненных
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	Уровень1.РодительИерархии,
			               |	Уровень1.СтруктураИерархии,
			               |	Уровень1.Период,
			               |	Уровень1.ПредыдущийРодитель,
			               |	Уровень1.ОбъектИерархии
			               |ИЗ
			               |	Уровень1 КАК Уровень1
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	Уровень2.РодительИерархии,
			               |	Уровень2.СтруктураИерархии,
			               |	Уровень2.Период,
			               |	Уровень2.ПредыдущийРодитель,
			               |	Уровень2.ОбъектИерархии
			               |ИЗ
			               |	Уровень2 КАК Уровень2
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ВсеУровни.РодительИерархии КАК РодительИерархии,
			               |	ВсеУровни.СтруктураИерархии КАК СтруктураИерархии,
			               |	ВсеУровни.Период КАК Период,
			               |	ВсеУровни.ПредыдущийРодитель КАК ПредыдущийРодитель,
			               |	ВсеУровни.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоМонтаж,
			               |	ВсеУровни.ПредыдущийРодитель.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоДемонтаж,
			               |	ВсеУровни.ОбъектИерархии КАК ОбъектИерархии
			               |ПОМЕСТИТЬ ВсеУровниСМонтажом
			               |ИЗ
			               |	ВсеУровни КАК ВсеУровни
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВсеУровни.ОбъектИерархии КАК ОбъектИерархии,
			               |	МАКСИМУМ(ВсеУровни.ЭтоМонтаж) КАК ЭтоМонтаж,
			               |	ВсеУровни.СтруктураИерархии КАК СтруктураИерархии,
			               |	ВсеУровни.Период КАК Период
			               |ПОМЕСТИТЬ ПриоритетыИтога
			               |ИЗ
			               |	ВсеУровниСМонтажом КАК ВсеУровни
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВсеУровни.ОбъектИерархии,
			               |	ВсеУровни.СтруктураИерархии,
			               |	ВсеУровни.Период
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ВсеУровни.РодительИерархии КАК РодительИерархии,
			               |	ВсеУровни.СтруктураИерархии КАК СтруктураИерархии,
			               |	ВсеУровни.Период КАК Период,
			               |	ВсеУровни.ПредыдущийРодитель КАК ПредыдущийРодитель,
			               |	ВсеУровни.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоМонтаж,
			               |	ВсеУровни.ПредыдущийРодитель.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоДемонтаж,
			               |	ВсеУровни.ОбъектИерархии КАК ОбъектИерархии
			               |ИЗ
			               |	ВсеУровниСМонтажом КАК ВсеУровни
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетыИтога КАК ПриоритетыИтога
			               |		ПО ВсеУровни.ОбъектИерархии = ПриоритетыИтога.ОбъектИерархии
			               |			И ВсеУровни.СтруктураИерархии = ПриоритетыИтога.СтруктураИерархии
			               |			И ВсеУровни.Период = ПриоритетыИтога.Период
			               |			И ВсеУровни.ЭтоМонтаж = ПриоритетыИтога.ЭтоМонтаж";
				Запрос.УстановитьПараметр("ТЧ", ТабЧасть);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураИерархии);
			Запрос.УстановитьПараметр("Дата", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() = Ложь Тогда 
				// записать новые
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.ЭтоМонтаж = Истина Тогда 
						НаборЗаписей = РегистрыСведений.торо_ИсторияПеремещенияОборудованияМеждуФМ.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.ФункциональноеМесто.Установить(Выборка.РодительИерархии);
						НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектИерархии);
						НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
						НоваяСтрока = НаборЗаписей.Добавить();
						НоваяСтрока.Период = Выборка.Период;
						НоваяСтрока.ОбъектРемонта = Выборка.ОбъектИерархии;
						НоваяСтрока.ФункциональноеМесто = Выборка.РодительИерархии;
						НоваяСтрока.Событие = Перечисления.торо_СобытияОборудованияНаФМ.Установка;
						НаборЗаписей.Записать();
					КонецЕсли;
					//
					Если Выборка.ЭтоДемонтаж = Истина Тогда 
						НаборЗаписей = РегистрыСведений.торо_ИсторияПеремещенияОборудованияМеждуФМ.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.ФункциональноеМесто.Установить(Выборка.ПредыдущийРодитель);
						НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектИерархии);
						НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
						НоваяСтрока = НаборЗаписей.Добавить();
						НоваяСтрока.Период = Выборка.Период;
						НоваяСтрока.ОбъектРемонта = Выборка.ОбъектИерархии;
						НоваяСтрока.ФункциональноеМесто = Выборка.ПредыдущийРодитель;
						НоваяСтрока.Событие = Перечисления.торо_СобытияОборудованияНаФМ.Демонтаж;
						НаборЗаписей.Записать();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Расш_гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.торо_РасположениеОРВСтруктуреИерархии.Очистить();

	// регистр торо_РасположениеОРВСтруктуреИерархии
	Для Каждого ТекСтрокаПоложенияВСтруктуреИерархии Из ПоложенияВСтруктуреИерархии Цикл

		Если Не ТипЗнч(ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда

			НоваяГруппаОР = Справочники.торо_ОбъектыРемонта.СоздатьГруппу();
			НоваяГруппаОР.Наименование = Строка(ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии);

			Попытка
				НоваяГруппаОР.Записать();

				СтрокаОбъектИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии;

				ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии = НоваяГруппаОР.Ссылка;

				МассивСтрокСЭтимРодителем = ПоложенияВСтруктуреИерархии.НайтиСтроки(Новый Структура("РодительИерархии", СтрокаОбъектИерархии));

				Для каждого СтрокаПоложения Из МассивСтрокСЭтимРодителем Цикл
					СтрокаПоложения.РодительИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии;
				КонецЦикла; 

			Исключение
				#Удаление
				ШаблонСообщения = НСтр("ru = 'Не удалось создать группу объектов ремонта ""%1""'");
				#КонецУдаления
				#Вставка
				ШаблонСообщения = НСтр("es='No consiguió crear el grupo de los objetos de la reparación ""%1""';
				|ru='Не удалось создать группу объектов ремонта ""%1""';en=""Failed to create repair object group '%1'""");
				#КонецВставки
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецПопытки;

		КонецЕсли; 


		Движение = Движения.торо_РасположениеОРВСтруктуреИерархии.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии;
		Движение.СтруктураИерархии = СтруктураИерархии;
		Движение.РодительИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.РодительИерархии;
		Движение.Удален = ТекСтрокаПоложенияВСтруктуреИерархии.Удален;

	КонецЦикла;

	#Вставка
	гкс_ОбработкаПроведения(Отказ, РежимПроведения);
	#КонецВставки

КонецПроцедуры

#КонецОбласти
